src/InformationRegisters/ОтметкиВремениИзмененияСведенийПисем/ОтметкиВремениИзмененияСведенийПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтметкиВремениИзмененияСведенийПисем</name>
  <dimensions>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтметкиВремениСсылочныхДанных/ОтметкиВремениСсылочныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтметкиВремениСсылочныхДанных</name>
  <resources>
    <name>Отметка</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.СсылкиДляОтметокВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/МП_ИзмененныеСостоянияПриглашенийНаМероприятия/МП_ИзмененныеСостоянияПриглашенийНаМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ИзмененныеСостоянияПриглашенийНаМероприятия</name>
  <dimensions>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/МП_СинхронизацияПроектов/МП_СинхронизацияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_СинхронизацияПроектов</name>
  <resources>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ОбменСМобильнымиТипыНастроекПользователей/ОбменСМобильнымиТипыНастроекПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбменСМобильнымиТипыНастроекПользователей</name>
  <enumValues>
    <name>ВидРаботПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьPushУведомления</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйРазмерВложения</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйРазмерФайлов</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеФорматовПередаваемыхФайлов</name>
  </enumValues>
  <enumValues>
    <name>ПериодПервичнойЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ПодробныйПротоколОбменаСМобильнымУстройством</name>
  </enumValues>
  <enumValues>
    <name>ПроектПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияАдреснойКниги</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияЗадач</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКалендаря</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияМероприятий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияОтсутствий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияПочты</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияСамочувствий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияУчетаВремени</name>
  </enumValues>
  <enumValues>
    <name>СпособУказанияВремени</name>
  </enumValues>
  <enumValues>
    <name>СрокУстареванияДанных</name>
  </enumValues>
  <enumValues>
    <name>ФорматыПередаваемыхФайлов</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОтметкиВремениСобытия/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОтметкиВремениПриЗаписиСсылочныхОбъектов(Объект, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Объект) Тогда
		Возврат;
	КонецЕсли;
		
	ОтметкиВремени.ПриЗаписиОбъекта(Объект, "СсылочныйОбъект");
	
КонецПроцедуры

Процедура ОтметкиВремениПередУдалениемСсылочныхОбъектов(Объект, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	УдалениеОбъекта = Новый УдалениеОбъекта(Объект.Ссылка);
	ОтметкиВремени.ПриЗаписиОбъекта(УдалениеОбъекта, "УдалениеОбъекта");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтметкиВремениИзмененияСведенийПисем(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповПисьма = Новый Массив;
	МассивТиповПисьма.Добавить(Тип("ДокументСсылка.ВходящееПисьмо"));
	МассивТиповПисьма.Добавить(Тип("ДокументСсылка.ИсходящееПисьмо"));
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		ЗначениеЭлементаОтбора = ЭлементОтбора.Значение;
		
		Если (ЭлементОтбора.Имя = "Объект" Или ЭлементОтбора.Имя = "Документ") 
			И (МассивТиповПисьма.Найти(ТипЗнч(ЗначениеЭлементаОтбора)) <> Неопределено
			И ЗначениеЗаполнено(ЗначениеЭлементаОтбора)) Тогда
			
			УчетнаяЗапись = МП_СлужебныйПовтИспНаВремяВызова.УчетнаяЗаписьПисьма(ЗначениеЭлементаОтбора);
			
			РегистрыСведений.ОтметкиВремениИзмененияСведенийПисем.ДобавитьЗапись(УчетнаяЗапись, ЗначениеЭлементаОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметкиВремениИзмененияПисем(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ОтметкиВремениИзмененияСведенийПисем.ДобавитьЗапись(Источник.УчетнаяЗапись, Источник.Ссылка);
	
КонецПроцедуры

Процедура ОтметкиВремениИзмененияЦветаИФлага(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		ЗначениеЭлементаОтбора = ЭлементОтбора.Значение;
		
		Если (ЭлементОтбора.Имя = "Объект" Или ЭлементОтбора.Имя = "Событие")
			И ЗначениеЗаполнено(ЗначениеЭлементаОтбора) Тогда
			ОтметкиВремени.ПриЗаписиОбъекта(ЗначениеЭлементаОтбора, "СсылочныйОбъект");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметкиВремениИзмененияНастроекОбменаСМобильным(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		ЗначениеЭлементаОтбора = ЭлементОтбора.Значение;
		
		Если ЭлементОтбора.Имя = "Настройка"
			И ЗначениеЗаполнено(ЗначениеЭлементаОтбора) Тогда
			ОтметкиВремени.ПриЗаписиОбъекта(ЗначениеЭлементаОтбора, "СсылочныйОбъект");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметкиВремениИзмененияМаксимальногоРазмераФайлаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;

	ТипНастройкиМаксимальныйРазмерВложения =
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.МаксимальныйРазмерВложения;
		
	РегистрыСведений.ОтметкиВремениСсылочныхДанных.УстановитьОтметкуВремени(ТипНастройкиМаксимальныйРазмерВложения,
		ОтметкиВремени.Текущая());
	
КонецПроцедуры

Процедура ОтметкиВремениИзмененияСостоянийПриглашенияНаМероприятие(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеМероприятиями") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Имя = "Исполнитель" Тогда
			Исполнитель = ЭлементОтбора.Значение;
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "Мероприятие" Тогда
			Мероприятие = ЭлементОтбора.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			РегистрыСведений.МП_ИзмененныеСостоянияПриглашенийНаМероприятия.ДобавитьЗапись(Исполнитель, Мероприятие);
		Иначе
			Для Каждого Запись Из Источник Цикл
				РегистрыСведений.МП_ИзмененныеСостоянияПриглашенийНаМероприятия.ДобавитьЗапись(Запись.Исполнитель, Мероприятие);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОтметкиВремениИзмененияТрудозатрат(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтметкиВремени") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Имя = "Пользователь" Тогда
			Пользователь = ЭлементОтбора.Значение;
		КонецЕсли;
		
		Если ЭлементОтбора.Имя = "Проект" Тогда
			Проект = ЭлементОтбора.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Проект) Тогда
		РегистрыСведений.МП_СинхронизацияПроектов.СинхронизироватьПроектПриНеобходимости(Пользователь, Проект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
